from string import Template

### RAG PROMPTS ###

### SYSTEM ###
system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة اعتمادًا فقط على المعلومات الموجودة في هذه المستندات.",
    "تجاهل أي مستندات غير مرتبطة بسؤال المستخدم.",
    "إذا لم تتمكن من إيجاد إجابة مناسبة، يمكنك الاعتذار بشكل مهذب.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا في ردك.",
    "اجعل إجابتك دقيقة ومختصرة وتجنب المعلومات غير الضرورية.",
]))

### Document template
document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

### Footer ###
footer_template = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات أعلاه، يرجى توليد إجابة لسؤال المستخدم مع البدء بالاجابة مباشرة.",
        "## :السؤال",
        "$query",
        " ",
        "## الإجابة:",
    ])
)